## [liquibase-docs-prod](https://liquibase.app.spacelift.io/stack/liquibase-docs-prod/run/01J58S3ZJCF1XCDEN05B7MG97B) plan logs

<details>
<summary>Click here to expand</summary>

```
...
aws_s3_object.redirects["/workflows/database-setup-tutorials/mongodb"]: Refreshing state... [id=/workflows/database-setup-tutorials/mongodb]
aws_s3_object.redirects["/commands/config-ref/changelog-lock-poll-rate.html"]: Refreshing state... [id=/commands/config-ref/changelog-lock-poll-rate.html]
aws_s3_object.redirects["/xml/ns/dbchangelog/"]: Refreshing state... [id=/xml/ns/dbchangelog/]
aws_s3_object.redirects["/install/tutorials/cockroachdb.html"]: Refreshing state... [id=/install/tutorials/cockroachdb.html]
aws_s3_object.redirects["/workflows/liquibase-community/liquibase-auto-rollback.html"]: Refreshing state... [id=/workflows/liquibase-community/liquibase-auto-rollback.html]
aws_s3_object.redirects["/install/tutorials/cassandra.html"]: Refreshing state... [id=/install/tutorials/cassandra.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.6.0-0.1.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.6.0-0.1.html]
aws_s3_object.redirects["/tools-integrations/observability/operation-reports-update-report.html"]: Refreshing state... [id=/tools-integrations/observability/operation-reports-update-report.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-rollback-one-update-sql.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-rollback-one-update-sql.html]
aws_s3_object.redirects["/install/tutorials/interbase.html"]: Refreshing state... [id=/install/tutorials/interbase.html]
aws_s3_object.redirects["/concepts/changelogs/attributes/include-all.html"]: Refreshing state... [id=/concepts/changelogs/attributes/include-all.html]
aws_s3_object.redirects["/change-types/community/create-sequence.html"]: Refreshing state... [id=/change-types/community/create-sequence.html]
aws_s3_object.redirects["/start/tutorials/mongodb-pro-aws-doc-config.html"]: Refreshing state... [id=/start/tutorials/mongodb-pro-aws-doc-config.html]
aws_s3_object.redirects["/command-line/index.html"]: Refreshing state... [id=/command-line/index.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-generate-changelog.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-generate-changelog.html]
aws_s3_object.redirects["/commands/change-tracking/set-labels.html"]: Refreshing state... [id=/commands/change-tracking/set-labels.html]
aws_s3_object.redirects["/commands/quality-checks/checks/home.html"]: Refreshing state... [id=/commands/quality-checks/checks/home.html]
aws_s3_object.redirects["/secrets-management/hashicorp-vault.html"]: Refreshing state... [id=/secrets-management/hashicorp-vault.html]
aws_s3_object.redirects["/commands/quality-checks/multiple-objects.html"]: Refreshing state... [id=/commands/quality-checks/multiple-objects.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.7.1.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.7.1.html]
aws_s3_object.redirects["/concepts/advanced/quality-checks.html"]: Refreshing state... [id=/concepts/advanced/quality-checks.html]
aws_s3_object.redirects["/start/install/tutorials/sap-sql-anywhere.html"]: Refreshing state... [id=/start/install/tutorials/sap-sql-anywhere.html]
aws_s3_object.redirects["/commands/listlocks.html"]: Refreshing state... [id=/commands/listlocks.html]
aws_s3_object.redirects["/tools-integrations/maven/workflows/hub-pom-attributes.html"]: Refreshing state... [id=/tools-integrations/maven/workflows/hub-pom-attributes.html]
aws_s3_object.redirects["/drift-reports.html"]: Refreshing state... [id=/drift-reports.html]
aws_s3_object.redirects["/install/liquibase-linux.html"]: Refreshing state... [id=/install/liquibase-linux.html]
aws_s3_object.redirects["/commands/liquibase-start/init-start-h2.html"]: Refreshing state... [id=/commands/liquibase-start/init-start-h2.html]
aws_s3_object.redirects["/start/install/tutorials/oracle.html"]: Refreshing state... [id=/start/install/tutorials/oracle.html]
aws_s3_object.redirects["/concepts/changelog-parameters.html"]: Refreshing state... [id=/concepts/changelog-parameters.html]
aws_s3_object.redirects["/install/tutorials/informix.html"]: Refreshing state... [id=/install/tutorials/informix.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/popular-topics.html"]: Refreshing state... [id=/tools-integrations/maven/commands/popular-topics.html]
aws_s3_object.redirects["/commands/snapshotreference.html"]: Refreshing state... [id=/commands/snapshotreference.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-clear-checksums.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-clear-checksums.html]
aws_s3_object.redirects["/commands/liquibase-start/init-hub.html"]: Refreshing state... [id=/commands/liquibase-start/init-hub.html]
aws_s3_object.redirects["/commands/updatetotag.html"]: Refreshing state... [id=/commands/updatetotag.html]
aws_s3_object.redirects["/feature-flags/readmes/Supported Editions.html"]: Refreshing state... [id=/feature-flags/readmes/Supported Editions.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.4.2.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.4.2.html]
aws_s3_object.redirects["/commands/quality-checks/checks-delete.html"]: Refreshing state... [id=/commands/quality-checks/checks-delete.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/yugabytedb.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/yugabytedb.html]
aws_s3_object.redirects["/tools-integrations/secrets-management/cyberark-pam-vault.html"]: Refreshing state... [id=/tools-integrations/secrets-management/cyberark-pam-vault.html]
aws_s3_object.redirects["/concepts/installation/lb-developer-workflow.html"]: Refreshing state... [id=/concepts/installation/lb-developer-workflow.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-synchub.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-synchub.html]
aws_s3_object.redirects["/concepts/advanced/output-file-encoding.html"]: Refreshing state... [id=/concepts/advanced/output-file-encoding.html]
aws_s3_object.redirects["/tools-integrations/labs/shell-commands.html"]: Refreshing state... [id=/tools-integrations/labs/shell-commands.html]
aws_s3_object.redirects["/tools-integrations/extensions/remote-files/remote-file-path-rules.html"]: Refreshing state... [id=/tools-integrations/extensions/remote-files/remote-file-path-rules.html]
aws_s3_object.redirects["/commands/config-ref/diff-column-order.html"]: Refreshing state... [id=/commands/config-ref/diff-column-order.html]
aws_s3_object.redirects["/change-types/community/drop-column.html"]: Refreshing state... [id=/change-types/community/drop-column.html]
aws_s3_object.redirects["/start/release-notes/liquibase-release-notes/liquibase-4.6.0-0.1.html"]: Refreshing state... [id=/start/release-notes/liquibase-release-notes/liquibase-4.6.0-0.1.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/mssql.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/mssql.html]
aws_s3_object.redirects["/concepts/changelogs/attributes/use-sql-plus-integration.html"]: Refreshing state... [id=/concepts/changelogs/attributes/use-sql-plus-integration.html]
aws_s3_object.redirects["/commands/quality-checks/checks/database-checks/check-tables-for-index.html"]: Refreshing state... [id=/commands/quality-checks/checks/database-checks/check-tables-for-index.html]
aws_s3_object.redirects["/concepts/basic/home.html"]: Refreshing state... [id=/concepts/basic/home.html]
aws_s3_object.redirects["/start/install/tutorials/db2-luw.html"]: Refreshing state... [id=/start/install/tutorials/db2-luw.html]
aws_s3_object.redirects["/database-reports.html"]: Refreshing state... [id=/database-reports.html]
aws_s3_object.redirects["/install/liquibase-requirements.html"]: Refreshing state... [id=/install/liquibase-requirements.html]
aws_s3_object.redirects["/tools-integrations/observability/operation-reports.html"]: Refreshing state... [id=/tools-integrations/observability/operation-reports.html]
aws_s3_object.redirects["/commands/community/quality-checks/checks-copy.html"]: Refreshing state... [id=/commands/community/quality-checks/checks-copy.html]
aws_s3_object.redirects["/commands/quality-checks/checks/changelog-checks/user-defined-label-check.html"]: Refreshing state... [id=/commands/quality-checks/checks/changelog-checks/user-defined-label-check.html]
aws_s3_object.redirects["/commands/quality-checks/checks-show.html"]: Refreshing state... [id=/commands/quality-checks/checks-show.html]
aws_s3_object.redirects["/commands/config-ref/changelog-lock-wait-time-in-minutes-parameter.html"]: Refreshing state... [id=/commands/config-ref/changelog-lock-wait-time-in-minutes-parameter.html]
aws_s3_object.redirects["/start/get-started/getting-started-liquibase-sql-windows.html"]: Refreshing state... [id=/start/get-started/getting-started-liquibase-sql-windows.html]
aws_s3_object.redirects["/tools-integrations/ant/commands/generatechangelog.html"]: Refreshing state... [id=/tools-integrations/ant/commands/generatechangelog.html]
aws_s3_object.redirects["/concepts/advanced/include-catalog-in-specification-parameter.html"]: Refreshing state... [id=/concepts/advanced/include-catalog-in-specification-parameter.html]
aws_s3_object.redirects["/concepts/installation/liquibase-system-requirements.html"]: Refreshing state... [id=/concepts/installation/liquibase-system-requirements.html]
aws_s3_object.redirects["/start/install/tutorials/vertica.html"]: Refreshing state... [id=/start/install/tutorials/vertica.html]
aws_s3_object.redirects["/install/tutorials/oracle-atp-db.html"]: Refreshing state... [id=/install/tutorials/oracle-atp-db.html]
aws_s3_object.redirects["/install/tutorials/h2.html"]: Refreshing state... [id=/install/tutorials/h2.html]
aws_s3_object.redirects["/commands/hub/sync-hub.html"]: Refreshing state... [id=/commands/hub/sync-hub.html]
aws_s3_object.redirects["/feature-flags/readmes/CloudBees Feature Management.html"]: Refreshing state... [id=/feature-flags/readmes/CloudBees Feature Management.html]
aws_s3_object.redirects["/start/tutorials/db2onz.html"]: Refreshing state... [id=/start/tutorials/db2onz.html]
aws_s3_object.redirects["/start/install/tutorials/cassandra-astra.html"]: Refreshing state... [id=/start/install/tutorials/cassandra-astra.html]
aws_s3_object.redirects["/commands/community/changelogsynctotag.html"]: Refreshing state... [id=/commands/community/changelogsynctotag.html]
aws_s3_object.redirects["/change-types/community/insert.html"]: Refreshing state... [id=/change-types/community/insert.html]
aws_s3_object.redirects["/concepts/changelogs/attributes/changeset-elements-and-attributes.html"]: Refreshing state... [id=/concepts/changelogs/attributes/changeset-elements-and-attributes.html]
aws_s3_object.redirects["/concepts/databasechangeloglock-table.html"]: Refreshing state... [id=/concepts/databasechangeloglock-table.html]
aws_s3_object.redirects["/concepts/installation/setup-gitlab-cicd.html"]: Refreshing state... [id=/concepts/installation/setup-gitlab-cicd.html]
aws_s3_object.redirects["/tools-integrations/observability/structured-logging-keys.html"]: Refreshing state... [id=/tools-integrations/observability/structured-logging-keys.html]
aws_s3_object.redirects["/concepts/changelogs/runonchange.html"]: Refreshing state... [id=/concepts/changelogs/runonchange.html]
aws_s3_object.redirects["/tools-integrations/extensions/remote-files/s3-commands.html"]: Refreshing state... [id=/tools-integrations/extensions/remote-files/s3-commands.html]
aws_s3_object.redirects["/concepts/advanced/liquibase-pro-certified-databases.html"]: Refreshing state... [id=/concepts/advanced/liquibase-pro-certified-databases.html]
aws_s3_object.redirects["/change-types/community/execute-command.htm"]: Refreshing state... [id=/change-types/community/execute-command.htm]
aws_s3_object.redirects["/start/getting-started-with-liquibase-and-sql-on-linux-macos.html"]: Refreshing state... [id=/start/getting-started-with-liquibase-and-sql-on-linux-macos.html]
aws_s3_object.redirects["/commands/community/snapshot.html"]: Refreshing state... [id=/commands/community/snapshot.html]
aws_s3_object.redirects["/concepts/basic/sql-format.html"]: Refreshing state... [id=/concepts/basic/sql-format.html]
aws_s3_object.redirects["/commands/quality-checks/checks/object-name-must-not-match.html"]: Refreshing state... [id=/commands/quality-checks/checks/object-name-must-not-match.html]
aws_s3_object.redirects["/workflows/quality-checks/concepts/json-object.html"]: Refreshing state... [id=/workflows/quality-checks/concepts/json-object.html]
aws_s3_object.redirects["/concepts/advanced/filter-log-messages.html"]: Refreshing state... [id=/concepts/advanced/filter-log-messages.html]
aws_s3_object.redirects["/concepts/basic/java-opts-environment-variable.html"]: Refreshing state... [id=/concepts/basic/java-opts-environment-variable.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-changelog-sync.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-changelog-sync.html]
aws_s3_object.redirects["/start/getting-started-liquibase-xml-linux.html"]: Refreshing state... [id=/start/getting-started-liquibase-xml-linux.html]
aws_s3_object.redirects["/change-types/community/sql.html"]: Refreshing state... [id=/change-types/community/sql.html]
aws_s3_object.redirects["/tools-integrations/native-executors/oracle-sqlplus-proxy-user.html"]: Refreshing state... [id=/tools-integrations/native-executors/oracle-sqlplus-proxy-user.html]
aws_s3_object.redirects["/tools-integrations/observability/structured-logging-custom-data.html"]: Refreshing state... [id=/tools-integrations/observability/structured-logging-custom-data.html]
aws_s3_object.redirects["/concepts/installation/home.html"]: Refreshing state... [id=/concepts/installation/home.html]
aws_s3_object.redirects["/documentation/labels.html"]: Refreshing state... [id=/documentation/labels.html]
aws_s3_object.redirects["/install/tutorials/firebird.html"]: Refreshing state... [id=/install/tutorials/firebird.html]
aws_s3_object.redirects["/install/tutorials/postgresql.html"]: Refreshing state... [id=/install/tutorials/postgresql.html]
aws_s3_object.redirects["/commands/status/history.html"]: Refreshing state... [id=/commands/status/history.html]
aws_s3_object.redirects["/commands/maintenance/tag-exists.html"]: Refreshing state... [id=/commands/maintenance/tag-exists.html]
aws_s3_object.redirects["/start/get-started/getting-started-liquibase-json-linux.html"]: Refreshing state... [id=/start/get-started/getting-started-liquibase-json-linux.html]
aws_s3_object.redirects["/workflows/liquibase-community/running-liquibase-percona-toolkit-changes.html"]: Refreshing state... [id=/workflows/liquibase-community/running-liquibase-percona-toolkit-changes.html]
aws_s3_object.redirects["/commands/config-ref/output-file-encoding.html"]: Refreshing state... [id=/commands/config-ref/output-file-encoding.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.25.0.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.25.0.html]
aws_s3_object.redirects["/2014/11/faq.html"]: Refreshing state... [id=/2014/11/faq.html]
aws_s3_object.redirects["/commands/community/updatecountsql.html"]: Refreshing state... [id=/commands/community/updatecountsql.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.19.0.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.19.0.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/impala-hive.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/impala-hive.html]
aws_s3_object.redirects["/commands/community/quality-checks/multiple-objects.html"]: Refreshing state... [id=/commands/community/quality-checks/multiple-objects.html]
aws_s3_object.redirects["/tools-integrations/remote-files/s3.html"]: Refreshing state... [id=/tools-integrations/remote-files/s3.html]
aws_s3_object.redirects["/tools-integrations/extensions/extension-upgrade-guides/home.html"]: Refreshing state... [id=/tools-integrations/extensions/extension-upgrade-guides/home.html]
aws_s3_object.redirects["/start/tutorials/postgresql.html"]: Refreshing state... [id=/start/tutorials/postgresql.html]
aws_s3_object.redirects["/commands/quality-checks/constraint-must-exist.html"]: Refreshing state... [id=/commands/quality-checks/constraint-must-exist.html]
aws_s3_object.redirects["/commands/snapshot/generate-changelog.html"]: Refreshing state... [id=/commands/snapshot/generate-changelog.html]
aws_s3_object.redirects["/commands/quality-checks/checks/changelog-checks/sql-user-defined-pattern-check.html"]: Refreshing state... [id=/commands/quality-checks/checks/changelog-checks/sql-user-defined-pattern-check.html]
aws_s3_object.redirects["/concepts/changelogs/runwith.html"]: Refreshing state... [id=/concepts/changelogs/runwith.html]
aws_s3_object.redirects["/change-types/community/add-unique-constraint.html"]: Refreshing state... [id=/change-types/community/add-unique-constraint.html]
aws_s3_object.redirects["/commands/java-opts-environment-variable.html"]: Refreshing state... [id=/commands/java-opts-environment-variable.html]
aws_s3_object.redirects["/parameters/logical-file-path.html"]: Refreshing state... [id=/parameters/logical-file-path.html]
aws_s3_object.redirects["/parameters/on-missing-include.html"]: Refreshing state... [id=/parameters/on-missing-include.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-changelog-sync-to-tag-sql.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-changelog-sync-to-tag-sql.html]
aws_s3_object.redirects["/tools-integrations/extensions/remote-files/s3.html"]: Refreshing state... [id=/tools-integrations/extensions/remote-files/s3.html]
aws_s3_object.redirects["/commands/rollbacktodate.html"]: Refreshing state... [id=/commands/rollbacktodate.html]
aws_s3_object.redirects["/start/getting-started-liquibase-json-linux.html"]: Refreshing state... [id=/start/getting-started-liquibase-json-linux.html]
aws_s3_object.redirects["/tools-integrations/remote-files/s3-commands.html"]: Refreshing state... [id=/tools-integrations/remote-files/s3-commands.html]
aws_s3_object.redirects["/commands/quality-checks/parameters/checks-scope.html"]: Refreshing state... [id=/commands/quality-checks/parameters/checks-scope.html]
aws_s3_object.redirects["/install/tutorials/percona-xtradb-cluster.html"]: Refreshing state... [id=/install/tutorials/percona-xtradb-cluster.html]
aws_s3_object.redirects["/workflows/liquibase-community/modify-sql.html"]: Refreshing state... [id=/workflows/liquibase-community/modify-sql.html]
aws_s3_object.redirects["/start/tutorials/hsqldb.html"]: Refreshing state... [id=/start/tutorials/hsqldb.html]
aws_s3_object.redirects["/commands/community/faq.html"]: Refreshing state... [id=/commands/community/faq.html]
aws_s3_object.redirects["/concepts/changeset.html"]: Refreshing state... [id=/concepts/changeset.html]
aws_s3_object.redirects["/commands/config-ref/logfile-parameter.html"]: Refreshing state... [id=/commands/config-ref/logfile-parameter.html]
aws_s3_object.redirects["/commands/community/quality-checks/checks-run.html"]: Refreshing state... [id=/commands/community/quality-checks/checks-run.html]
aws_s3_object.redirects["/tools-integrations/liquibase-hub/operations.html"]: Refreshing state... [id=/tools-integrations/liquibase-hub/operations.html]
aws_s3_object.redirects["/install/tutorials/cassandra-astra.html"]: Refreshing state... [id=/install/tutorials/cassandra-astra.html]
aws_s3_object.redirects["/commands/config-ref/headless-parameter.html"]: Refreshing state... [id=/commands/config-ref/headless-parameter.html]
aws_s3_object.redirects["/commands/quality-checks/checks/changelog-database-checks/table-column-limit.html"]: Refreshing state... [id=/commands/quality-checks/checks/changelog-database-checks/table-column-limit.html]
aws_s3_object.redirects["/start/release-notes/mongodb-extension-release-notes.html"]: Refreshing state... [id=/start/release-notes/mongodb-extension-release-notes.html]
aws_s3_object.redirects["/commands/quality-checks/checks/oracle-reserved-keywords.html"]: Refreshing state... [id=/commands/quality-checks/checks/oracle-reserved-keywords.html]
aws_s3_object.redirects["/commands/quality-checks/checks/changelog-checks/end-delimiter-exists-when-pattern-exists.html"]: Refreshing state... [id=/commands/quality-checks/checks/changelog-checks/end-delimiter-exists-when-pattern-exists.html]
aws_s3_object.redirects["/install/tutorials/mariadb.html"]: Refreshing state... [id=/install/tutorials/mariadb.html]
aws_s3_object.redirects["/concepts/installation/using-the-lb-installer-for-linux-unix-mac.html"]: Refreshing state... [id=/concepts/installation/using-the-lb-installer-for-linux-unix-mac.html]
aws_s3_object.redirects["/install/tutorials/db2onz.html"]: Refreshing state... [id=/install/tutorials/db2onz.html]
aws_s3_object.redirects["/start/tutorials/bigquery.html"]: Refreshing state... [id=/start/tutorials/bigquery.html]
aws_s3_object.redirects["/flow.html"]: Refreshing state... [id=/flow.html]
aws_s3_object.redirects["/commands/quality-checks/workflows/using-the-checks-settings-configuration-file.html"]: Refreshing state... [id=/commands/quality-checks/workflows/using-the-checks-settings-configuration-file.html]
aws_s3_object.redirects["/change-types/pro/add-check-constraint.html"]: Refreshing state... [id=/change-types/pro/add-check-constraint.html]
aws_s3_object.redirects["/change-types/pro/create-package.html"]: Refreshing state... [id=/change-types/pro/create-package.html]
aws_s3_object.redirects["/concepts/changelogs/attributes/using-sql-plus-and-oracle-proxy-user.html"]: Refreshing state... [id=/concepts/changelogs/attributes/using-sql-plus-and-oracle-proxy-user.html]
aws_s3_object.redirects["/start/tutorials/mongodb-pro-amazon-documentdb.html"]: Refreshing state... [id=/start/tutorials/mongodb-pro-amazon-documentdb.html]
aws_s3_object.redirects["/commands/diff/diff-json.html"]: Refreshing state... [id=/commands/diff/diff-json.html]
aws_s3_object.redirects["/commands/community/snapshotreference.html"]: Refreshing state... [id=/commands/community/snapshotreference.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.23.0.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.23.0.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/interbase.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/interbase.html]
aws_s3_object.redirects["/commands/pro/rollbackoneupdatesql.html"]: Refreshing state... [id=/commands/pro/rollbackoneupdatesql.html]
aws_s3_object.redirects["/commands/quality-checks/workflows/multiple-objects.html"]: Refreshing state... [id=/commands/quality-checks/workflows/multiple-objects.html]
aws_s3_object.redirects["/commands/quality-checks/concepts/using-the-checks-settings-configuration-file.html"]: Refreshing state... [id=/commands/quality-checks/concepts/using-the-checks-settings-configuration-file.html]
aws_s3_object.redirects["/tools-integrations/observability/database-reports.html"]: Refreshing state... [id=/tools-integrations/observability/database-reports.html]
aws_s3_object.redirects["/start/tutorials/sap-sql-anywhere.html"]: Refreshing state... [id=/start/tutorials/sap-sql-anywhere.html]
aws_s3_object.redirects["/start/install/tutorials/mssql.html"]: Refreshing state... [id=/start/install/tutorials/mssql.html]
aws_s3_object.redirects["/change-types/community/rename-column.html"]: Refreshing state... [id=/change-types/community/rename-column.html]
aws_s3_object.redirects["/change-types/community/drop-index.html"]: Refreshing state... [id=/change-types/community/drop-index.html]
aws_s3_object.redirects["/start/install/tutorials/impala-hive.html"]: Refreshing state... [id=/start/install/tutorials/impala-hive.html]
aws_s3_object.redirects["/concepts/installation/installation-linux-unix-mac-windows-with-maven.html"]: Refreshing state... [id=/concepts/installation/installation-linux-unix-mac-windows-with-maven.html]
aws_s3_object.redirects["/bigquery"]: Refreshing state... [id=/bigquery]
aws_s3_object.redirects["/change-types/community/create-index.html"]: Refreshing state... [id=/change-types/community/create-index.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-registerchangelog.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-registerchangelog.html]
aws_s3_object.redirects["/start/install/tutorials/sqlite.html"]: Refreshing state... [id=/start/install/tutorials/sqlite.html]
aws_s3_object.redirects["/commands/community/quality-checks/checks-disable.html"]: Refreshing state... [id=/commands/community/quality-checks/checks-disable.html]
aws_s3_object.redirects["/commands/community/status-verbose.html"]: Refreshing state... [id=/commands/community/status-verbose.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-dropAll.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-dropAll.html]
aws_s3_object.redirects["/tools-integrations/labs/if-conditionals.html"]: Refreshing state... [id=/tools-integrations/labs/if-conditionals.html]
aws_s3_object.redirects["/install/liquibase-macos.html"]: Refreshing state... [id=/install/liquibase-macos.html]
aws_s3_object.redirects["/commands/community/marknextchangesetran.html"]: Refreshing state... [id=/commands/community/marknextchangesetran.html]
aws_s3_object.redirects["/concepts/changelogs/attributes/enddelimiter-sql.html"]: Refreshing state... [id=/concepts/changelogs/attributes/enddelimiter-sql.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/h2.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/h2.html]
aws_s3_object.redirects["/start/tutorials/mongodb-db-atlas-config.html"]: Refreshing state... [id=/start/tutorials/mongodb-db-atlas-config.html]
aws_s3_object.redirects["/concepts/advanced/include.html"]: Refreshing state... [id=/concepts/advanced/include.html]
aws_s3_object.redirects["/concepts/changelogs/attributes/using-psql-integration.html"]: Refreshing state... [id=/concepts/changelogs/attributes/using-psql-integration.html]
aws_s3_object.redirects["/change-types/community/drop-default-value.html"]: Refreshing state... [id=/change-types/community/drop-default-value.html]
aws_s3_object.redirects["/commands/clearchecksums.html"]: Refreshing state... [id=/commands/clearchecksums.html]
aws_s3_object.redirects["/tools-integrations/liquibase-hub/commands.html"]: Refreshing state... [id=/tools-integrations/liquibase-hub/commands.html]
aws_s3_object.redirects["/commands/quality-checks/checks/change-truncate-table-warn.html"]: Refreshing state... [id=/commands/quality-checks/checks/change-truncate-table-warn.html]
aws_s3_object.redirects["/commands/config-ref/help.html"]: Refreshing state... [id=/commands/config-ref/help.html]
aws_s3_object.redirects["/dropall.html"]: Refreshing state... [id=/dropall.html]
aws_s3_object.redirects["/workflows/liquibase-community/using-liquibase-java-api.html"]: Refreshing state... [id=/workflows/liquibase-community/using-liquibase-java-api.html]
aws_s3_object.redirects["/commands/quality-checks/checks/changelog-checks/changeset-label-check.html"]: Refreshing state... [id=/commands/quality-checks/checks/changelog-checks/changeset-label-check.html]
aws_s3_object.redirects["/concepts/advanced/liquibase-catalog-name-parameter.html"]: Refreshing state... [id=/concepts/advanced/liquibase-catalog-name-parameter.html]
aws_s3_object.redirects["/feature-flags/readmes/launchdarkly feature flags.html"]: Refreshing state... [id=/feature-flags/readmes/launchdarkly feature flags.html]
aws_s3_object.redirects["/install/tutorials/db2onzdeploy-sql.html"]: Refreshing state... [id=/install/tutorials/db2onzdeploy-sql.html]
aws_s3_object.redirects["/change-types/community/drop-all-foreign-key-constraints.html"]: Refreshing state... [id=/change-types/community/drop-all-foreign-key-constraints.html]
aws_s3_object.redirects["/commands/quality-checks/checks/changelog-checks/sql-grant-warn.html"]: Refreshing state... [id=/commands/quality-checks/checks/changelog-checks/sql-grant-warn.html]
aws_s3_object.redirects["/commands/config-ref/liquibase-tablespace-name.html"]: Refreshing state... [id=/commands/config-ref/liquibase-tablespace-name.html]
aws_s3_object.redirects["/commands/quality-checks/checks/changelog-database-checks/sql-server-reserved-keywords.html"]: Refreshing state... [id=/commands/quality-checks/checks/changelog-database-checks/sql-server-reserved-keywords.html]
aws_s3_object.redirects["/change-types/community/add-lookup-table.html"]: Refreshing state... [id=/change-types/community/add-lookup-table.html]
aws_s3_object.redirects["/start/get-started/getting-started-liquibase-xml-windows.html"]: Refreshing state... [id=/start/get-started/getting-started-liquibase-xml-windows.html]
aws_s3_object.redirects["/flow"]: Refreshing state... [id=/flow]
aws_s3_object.redirects["/commands/quality-checks/bulk-set.html"]: Refreshing state... [id=/commands/quality-checks/bulk-set.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.19.1.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.19.1.html]
aws_s3_object.redirects["/tools-integrations/maven/using-liquibase-and-maven-pom-file.html"]: Refreshing state... [id=/tools-integrations/maven/using-liquibase-and-maven-pom-file.html]
aws_s3_object.redirects["/commands/futurerollbackcountsql.html"]: Refreshing state... [id=/commands/futurerollbackcountsql.html]
aws_s3_object.redirects["/tools-integrations/extensions/secrets-management/aws-secrets-mgr.html"]: Refreshing state... [id=/tools-integrations/extensions/secrets-management/aws-secrets-mgr.html]
aws_s3_object.redirects["/feature-flags/readmes/cloudbees feature management.html"]: Refreshing state... [id=/feature-flags/readmes/cloudbees feature management.html]
aws_s3_object.redirects["/feature-flags/readmes/Flagsmith Feature Flags Extension.html"]: Refreshing state... [id=/feature-flags/readmes/Flagsmith Feature Flags Extension.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.9.0.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.9.0.html]
aws_s3_object.redirects["/concepts/databasechangelog-table.html"]: Refreshing state... [id=/concepts/databasechangelog-table.html]
aws_s3_object.redirects["/dropall"]: Refreshing state... [id=/dropall]
aws_s3_object.redirects["/tools-integrations/labs/flow.html"]: Refreshing state... [id=/tools-integrations/labs/flow.html]
aws_s3_object.redirects["/operation-reports"]: Refreshing state... [id=/operation-reports]
aws_s3_object.redirects["/commands/quality-checks/checks/changelog-checks/sql-grant-option-warn.html"]: Refreshing state... [id=/commands/quality-checks/checks/changelog-checks/sql-grant-option-warn.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/oracle-atp-db.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/oracle-atp-db.html]
aws_s3_object.redirects["/quality-checks"]: Refreshing state... [id=/quality-checks]
aws_s3_object.redirects["/commands/snapshot/snapshot-reference.html"]: Refreshing state... [id=/commands/snapshot/snapshot-reference.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.23.2.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.23.2.html]
aws_s3_object.redirects["/commands/docs/db-doc.html"]: Refreshing state... [id=/commands/docs/db-doc.html]
aws_s3_object.redirects["/commands/config-ref/database-class.html"]: Refreshing state... [id=/commands/config-ref/database-class.html]
aws_s3_object.redirects["/workflows/liquibase-pro/mariadbgrants.html"]: Refreshing state... [id=/workflows/liquibase-pro/mariadbgrants.html]
aws_s3_object.redirects["/commands/community/generatechangelog.html"]: Refreshing state... [id=/commands/community/generatechangelog.html]
aws_s3_object.redirects["/workflows/liquibase-community/using-liquibase-with-spinnaker.html"]: Refreshing state... [id=/workflows/liquibase-community/using-liquibase-with-spinnaker.html]
aws_s3_object.redirects["/start/get-started/getting-started-liquibase-sql-macos.html"]: Refreshing state... [id=/start/get-started/getting-started-liquibase-sql-macos.html]
aws_s3_object.redirects["/start/tutorials/mongodb-pro/amazon-documentdb-tls-ssl.html"]: Refreshing state... [id=/start/tutorials/mongodb-pro/amazon-documentdb-tls-ssl.html]
aws_s3_object.redirects["/commands/quality-checks/checks/table-comment-check.html"]: Refreshing state... [id=/commands/quality-checks/checks/table-comment-check.html]
aws_s3_object.redirects["/start/tutorials/mongo-db-atlas-config.html"]: Refreshing state... [id=/start/tutorials/mongo-db-atlas-config.html]
aws_s3_object.redirects["/start/getting-started-with-liquibase-and-yaml-on-linux-macos.html"]: Refreshing state... [id=/start/getting-started-with-liquibase-and-yaml-on-linux-macos.html]
aws_s3_object.redirects["/tools-integrations/ant/commands/changelogsynctotagsql.html"]: Refreshing state... [id=/tools-integrations/ant/commands/changelogsynctotagsql.html]
aws_s3_object.redirects["/commands/quality-checks/checks/changelog-checks/sql-server-reserved-keywords.html"]: Refreshing state... [id=/commands/quality-checks/checks/changelog-checks/sql-server-reserved-keywords.html]
aws_s3_object.redirects["/install/tutorials/connecting-to-an-oracle-database-with-liquibase-kerberos-and-ad.html"]: Refreshing state... [id=/install/tutorials/connecting-to-an-oracle-database-with-liquibase-kerberos-and-ad.html]
aws_s3_object.redirects["/commands/config-ref/include-catalog-in-specification-parameter.html"]: Refreshing state... [id=/commands/config-ref/include-catalog-in-specification-parameter.html]
aws_s3_object.redirects["/change-types/pro/drop-package-body.html"]: Refreshing state... [id=/change-types/pro/drop-package-body.html]
aws_s3_object.redirects["/start/tutorials/oracle-atp-db.html"]: Refreshing state... [id=/start/tutorials/oracle-atp-db.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-register-changelog.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-register-changelog.html]
aws_s3_object.redirects["/commands/quality-checks/checks/changelog-checks/home.html"]: Refreshing state... [id=/commands/quality-checks/checks/changelog-checks/home.html]
aws_s3_object.redirects["/start/tutorials/aws-redshift.html"]: Refreshing state... [id=/start/tutorials/aws-redshift.html]
aws_s3_object.redirects["/commands/quality-checks/checks/changelog-database-checks/object-name-must-not-match.html"]: Refreshing state... [id=/commands/quality-checks/checks/changelog-database-checks/object-name-must-not-match.html]
aws_s3_object.redirects["/start/tutorials/h2.html"]: Refreshing state... [id=/start/tutorials/h2.html]
aws_s3_object.redirects["/concepts/advanced/should-run-parameter.html"]: Refreshing state... [id=/concepts/advanced/should-run-parameter.html]
aws_s3_object.redirects["/start/tutorials/postgresql/google-cloud-sql.html"]: Refreshing state... [id=/start/tutorials/postgresql/google-cloud-sql.html]
aws_s3_object.redirects["/start/tutorials/cloud-spanner.html"]: Refreshing state... [id=/start/tutorials/cloud-spanner.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.8.0.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.8.0.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/home.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/home.html]
aws_s3_object.redirects["/workflows/liquibase-community/setup-github-actions-workflow.html"]: Refreshing state... [id=/workflows/liquibase-community/setup-github-actions-workflow.html]
aws_s3_object.redirects["/concepts/advanced/objectquotingstrategy.html"]: Refreshing state... [id=/concepts/advanced/objectquotingstrategy.html]
aws_s3_object.redirects["/commands/status/verbose.html"]: Refreshing state... [id=/commands/status/verbose.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.7.0.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.7.0.html]
aws_s3_object.redirects["/change-types/pro/enable-trigger.html"]: Refreshing state... [id=/change-types/pro/enable-trigger.html]
aws_s3_object.redirects["/concepts/advanced/using-the-changelogfile-logfile-outputfile-parameters.html"]: Refreshing state... [id=/concepts/advanced/using-the-changelogfile-logfile-outputfile-parameters.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/teradata.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/teradata.html]
aws_s3_object.redirects["/commands/tag.html"]: Refreshing state... [id=/commands/tag.html]
aws_s3_object.redirects["/change-types/community/load-update-data.html"]: Refreshing state... [id=/change-types/community/load-update-data.html]
aws_s3_object.redirects["/commands/maintenance/release-locks.html"]: Refreshing state... [id=/commands/maintenance/release-locks.html]
aws_s3_object.redirects["/secrets-management/cyberark-pam-vault.html"]: Refreshing state... [id=/secrets-management/cyberark-pam-vault.html]
aws_s3_object.redirects["/concepts/basic/databasechangeloglock-table.html"]: Refreshing state... [id=/concepts/basic/databasechangeloglock-table.html]
aws_s3_object.redirects["/operation-reports.html"]: Refreshing state... [id=/operation-reports.html]
aws_s3_object.redirects["/commands/community/diffchangelog.html"]: Refreshing state... [id=/commands/community/diffchangelog.html]
aws_s3_object.redirects["/start/tutorials/informix.html"]: Refreshing state... [id=/start/tutorials/informix.html]
aws_s3_object.redirects["/commands/quality-checks/show.html"]: Refreshing state... [id=/commands/quality-checks/show.html]
aws_s3_object.redirects["/concepts/labels.html"]: Refreshing state... [id=/concepts/labels.html]
aws_s3_object.redirects["/start/install/tutorials/oracle-atp-db.html"]: Refreshing state... [id=/start/install/tutorials/oracle-atp-db.html]
aws_s3_object.redirects["/commands/quality-checks/checks/sql-grant-option-warn.html"]: Refreshing state... [id=/commands/quality-checks/checks/sql-grant-option-warn.html]
aws_s3_object.redirects["/commands/maintenance/drop-all.html"]: Refreshing state... [id=/commands/maintenance/drop-all.html]
aws_s3_object.redirects["/workflows/liquibase-community/implementing-custom-change-exec-listener-class-with-liquibase.html"]: Refreshing state... [id=/workflows/liquibase-community/implementing-custom-change-exec-listener-class-with-liquibase.html]
aws_s3_object.redirects["/commands/config-ref/generated-changeset-ids-contains-description.html"]: Refreshing state... [id=/commands/config-ref/generated-changeset-ids-contains-description.html]
aws_s3_object.redirects["/start/tutorials/percona-xtradb-cluster.html"]: Refreshing state... [id=/start/tutorials/percona-xtradb-cluster.html]
aws_s3_object.redirects["/commands/quality-checks/checks/git-bash-quality-checks.html"]: Refreshing state... [id=/commands/quality-checks/checks/git-bash-quality-checks.html]
aws_s3_object.redirects["/change-types/community/drop-view.html"]: Refreshing state... [id=/change-types/community/drop-view.html]
aws_s3_object.redirects["/what-is-a-jdbc-url"]: Refreshing state... [id=/what-is-a-jdbc-url]
aws_s3_object.redirects["/tools-integrations/liquibase-hub/organizations.html"]: Refreshing state... [id=/tools-integrations/liquibase-hub/organizations.html]
aws_s3_object.redirects["/concepts/installation/setup-github-actions-workflow.html"]: Refreshing state... [id=/concepts/installation/setup-github-actions-workflow.html]
aws_s3_object.redirects["/tools-integrations/feature-flags/readmes/growthbook-feature-flags-extension.html"]: Refreshing state... [id=/tools-integrations/feature-flags/readmes/growthbook-feature-flags-extension.html]
aws_s3_object.redirects["/commands/change-tracking/tag.html"]: Refreshing state... [id=/commands/change-tracking/tag.html]
aws_s3_object.redirects["/commands/changelogsynctotag.html"]: Refreshing state... [id=/commands/changelogsynctotag.html]
aws_s3_object.redirects["/change-types/community/rename-sequence.html"]: Refreshing state... [id=/change-types/community/rename-sequence.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/cassandra-astra.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/cassandra-astra.html]
aws_s3_object.redirects["/tools-integrations/ant/commands/changelogsynctotag.html"]: Refreshing state... [id=/tools-integrations/ant/commands/changelogsynctotag.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.12.0.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.12.0.html]
aws_s3_object.redirects["/start/getting-started-with-liquibase-and-xml-on-windows.html"]: Refreshing state... [id=/start/getting-started-with-liquibase-and-xml-on-windows.html]
aws_s3_object.redirects["/commands/config-ref/convert-data-types-parameter.html"]: Refreshing state... [id=/commands/config-ref/convert-data-types-parameter.html]
aws_s3_object.redirects["/start/install/tutorials/cosmosdb.html"]: Refreshing state... [id=/start/install/tutorials/cosmosdb.html]
aws_s3_object.redirects["/concepts/installation/upgrading-liquibase.html"]: Refreshing state... [id=/concepts/installation/upgrading-liquibase.html]
aws_s3_object.redirects["/feature-flags/readmes/Flagr Feature Flags Extension_1.html"]: Refreshing state... [id=/feature-flags/readmes/Flagr Feature Flags Extension_1.html]
aws_s3_object.redirects["/pro-extensions.html"]: Refreshing state... [id=/pro-extensions.html]
aws_s3_object.redirects["/commands/quality-checks/checks/changelog-checks/max-affected-rows-allowed-update.html"]: Refreshing state... [id=/commands/quality-checks/checks/changelog-checks/max-affected-rows-allowed-update.html]
aws_s3_object.redirects["/install/supported-databases.html"]: Refreshing state... [id=/install/supported-databases.html]
aws_s3_object.redirects["/concepts/includeall.html"]: Refreshing state... [id=/concepts/includeall.html]
aws_s3_object.redirects["/observability.html"]: Refreshing state... [id=/observability.html]
aws_s3_object.redirects["/workflows/liquibase-community/homebrew-installation-for-macos.html"]: Refreshing state... [id=/workflows/liquibase-community/homebrew-installation-for-macos.html]
aws_s3_object.redirects["/commands/quality-checks/concepts/using-quality-checks-in-automation-severity-and-exit-code.html"]: Refreshing state... [id=/commands/quality-checks/concepts/using-quality-checks-in-automation-severity-and-exit-code.html]
aws_s3_object.redirects["/commands/community/dbdoc.html"]: Refreshing state... [id=/commands/community/dbdoc.html]
aws_s3_object.redirects["/commands/quality-checks/checks/database-checks/home.html"]: Refreshing state... [id=/commands/quality-checks/checks/database-checks/home.html]
aws_s3_object.redirects["/commands/community/validate.html"]: Refreshing state... [id=/commands/community/validate.html]
aws_s3_object.redirects["/concepts/advanced/logicalfilepath.html"]: Refreshing state... [id=/concepts/advanced/logicalfilepath.html]
aws_s3_object.redirects["/tools-integrations/feature-flags/readmes/liquibase-custom-hosts-extension.html"]: Refreshing state... [id=/tools-integrations/feature-flags/readmes/liquibase-custom-hosts-extension.html]
aws_s3_object.redirects["/commands/rollbackcountsql.html"]: Refreshing state... [id=/commands/rollbackcountsql.html]
aws_s3_object.redirects["/commands/community/diff-json.html"]: Refreshing state... [id=/commands/community/diff-json.html]
aws_s3_object.redirects["/start/tutorials/db2onzdeploy-sql.html"]: Refreshing state... [id=/start/tutorials/db2onzdeploy-sql.html]
aws_s3_object.redirects["/commands/quality-checks/checks-bulk-set.html"]: Refreshing state... [id=/commands/quality-checks/checks-bulk-set.html]
aws_s3_object.redirects["/commands/quality-checks/checks/require-chaneset-dis-uuid.html"]: Refreshing state... [id=/commands/quality-checks/checks/require-chaneset-dis-uuid.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/redshift.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/redshift.html]
aws_s3_object.redirects["/commands/quality-checks/checks/constraint-must-exist.html"]: Refreshing state... [id=/commands/quality-checks/checks/constraint-must-exist.html]
aws_s3_object.redirects["/change-types/pro/drop-synonym.html"]: Refreshing state... [id=/change-types/pro/drop-synonym.html]
aws_s3_object.redirects["/documentation/changeset"]: Refreshing state... [id=/documentation/changeset]
aws_s3_object.redirects["/start/tutorials/cassandra.html"]: Refreshing state... [id=/start/tutorials/cassandra.html]
aws_s3_object.redirects["/commands/community/future-rollback-from-tag-sql.html"]: Refreshing state... [id=/commands/community/future-rollback-from-tag-sql.html]
aws_s3_object.redirects["/change-types/community/home.html"]: Refreshing state... [id=/change-types/community/home.html]
aws_s3_object.redirects["/commands/flow/shell-commands.html"]: Refreshing state... [id=/commands/flow/shell-commands.html]
aws_s3_object.redirects["/change-types/community/update.html"]: Refreshing state... [id=/change-types/community/update.html]
aws_s3_object.redirects["/start/install/tutorials/h2.html"]: Refreshing state... [id=/start/install/tutorials/h2.html]
aws_s3_object.redirects["/workflows/liquibase-community/creating-config-properties.html"]: Refreshing state... [id=/workflows/liquibase-community/creating-config-properties.html]
aws_s3_object.redirects["/commands/quality-checks/json-object.html"]: Refreshing state... [id=/commands/quality-checks/json-object.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-migratesql.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-migratesql.html]
aws_s3_object.redirects["/commands/community/diff.html"]: Refreshing state... [id=/commands/community/diff.html]
aws_s3_object.redirects["/feature-flags/readmes/LaunchDarkly Feature Flags.html"]: Refreshing state... [id=/feature-flags/readmes/LaunchDarkly Feature Flags.html]
aws_s3_object.redirects["/start/install/tutorials/cloud-spanner.html"]: Refreshing state... [id=/start/install/tutorials/cloud-spanner.html]
aws_s3_object.redirects["/commands/marknextchangesetran.html"]: Refreshing state... [id=/commands/marknextchangesetran.html]
aws_s3_object.redirects["/structured-logging"]: Refreshing state... [id=/structured-logging]
aws_s3_object.redirects["/commands/quality-checks/copy.html"]: Refreshing state... [id=/commands/quality-checks/copy.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/aws-redshift.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/aws-redshift.html]
aws_s3_object.redirects["/concepts/installation/setup-workspace-installer.html"]: Refreshing state... [id=/concepts/installation/setup-workspace-installer.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-drop-all.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-drop-all.html]
aws_s3_object.redirects["/commands/liquibase-start/home.html"]: Refreshing state... [id=/commands/liquibase-start/home.html]
aws_s3_object.redirects["/workflows/liquibase-community/using-the-jenkins-pipeline-stage-with-spinnaker.html"]: Refreshing state... [id=/workflows/liquibase-community/using-the-jenkins-pipeline-stage-with-spinnaker.html]
aws_s3_object.redirects["/commands/quality-checks/checks/quality-checks-databases.html"]: Refreshing state... [id=/commands/quality-checks/checks/quality-checks-databases.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/postgresql.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/postgresql.html]
aws_s3_object.redirects["/concepts/installation/running-first-update-installer.html"]: Refreshing state... [id=/concepts/installation/running-first-update-installer.html]
aws_s3_object.redirects["/commands/quality-checks/checks/changelog-database-checks/sql-server-future-reserved-keywords.html"]: Refreshing state... [id=/commands/quality-checks/checks/changelog-database-checks/sql-server-future-reserved-keywords.html]
aws_s3_object.redirects["/start/getting-started-with-liquibase-and-json-on-windows.html"]: Refreshing state... [id=/start/getting-started-with-liquibase-and-json-on-windows.html]
aws_s3_object.redirects["/commands/quality-checks/checks/changelog-database-checks/sql-server-odbc-reserved-keywords.html"]: Refreshing state... [id=/commands/quality-checks/checks/changelog-database-checks/sql-server-odbc-reserved-keywords.html]
aws_s3_object.redirects["/commands/quality-checks/checks/changelog-checks/changeset-comment-check.html"]: Refreshing state... [id=/commands/quality-checks/checks/changelog-checks/changeset-comment-check.html]
aws_s3_object.redirects["/start/tutorials/neo4j.html"]: Refreshing state... [id=/start/tutorials/neo4j.html]
aws_s3_object.redirects["/custom-policy-checks"]: Refreshing state... [id=/custom-policy-checks]
aws_s3_object.redirects["/tools-integrations/observability/structured-logging.html"]: Refreshing state... [id=/tools-integrations/observability/structured-logging.html]
aws_s3_object.redirects["/concepts/advanced/column.html"]: Refreshing state... [id=/concepts/advanced/column.html]
aws_s3_object.redirects["/commands/quality-checks/checks/changelog-database-checks/postgres-reserved-keywords.html"]: Refreshing state... [id=/commands/quality-checks/checks/changelog-database-checks/postgres-reserved-keywords.html]
aws_s3_object.redirects["/commands/generatechangelog.html"]: Refreshing state... [id=/commands/generatechangelog.html]
aws_s3_object.redirects["/commands/maintenance/calculate-checksum.html"]: Refreshing state... [id=/commands/maintenance/calculate-checksum.html]
aws_s3_object.redirects["/install/tutorials/vertica.html"]: Refreshing state... [id=/install/tutorials/vertica.html]
aws_s3_object.redirects["/start/getting-started-liquibase-sql-linux-macos.html"]: Refreshing state... [id=/start/getting-started-liquibase-sql-linux-macos.html]
aws_s3_object.redirects["/tools-integrations/feature-flags/readmes/flagsmith-feature-flags-extension.html"]: Refreshing state... [id=/tools-integrations/feature-flags/readmes/flagsmith-feature-flags-extension.html]
aws_s3_object.redirects["/commands/quality-checks/checks/changelog-checks/change-drop-table-warn.html"]: Refreshing state... [id=/commands/quality-checks/checks/changelog-checks/change-drop-table-warn.html]
aws_s3_object.redirects["/commands/pro/checks-bulk-set.html"]: Refreshing state... [id=/commands/pro/checks-bulk-set.html]
aws_s3_object.redirects["/commands/update/validate.html"]: Refreshing state... [id=/commands/update/validate.html]
aws_s3_object.redirects["/start/tutorials/mssql.html"]: Refreshing state... [id=/start/tutorials/mssql.html]
aws_s3_object.redirects["/feature-flags/readmes/ConfigCat Feature Flags Extension.html"]: Refreshing state... [id=/feature-flags/readmes/ConfigCat Feature Flags Extension.html]
aws_s3_object.redirects["/concepts/advanced/always-override-stored-logic-schema.html"]: Refreshing state... [id=/concepts/advanced/always-override-stored-logic-schema.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-migrate.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-migrate.html]
aws_s3_object.redirects["/concepts/basic/changelog.html"]: Refreshing state... [id=/concepts/basic/changelog.html]
aws_s3_object.redirects["/what-is-a-jdbc-url.html"]: Refreshing state... [id=/what-is-a-jdbc-url.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/apache-derby.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/apache-derby.html]
aws_s3_object.redirects["/commands/rollbackoneupdate.html"]: Refreshing state... [id=/commands/rollbackoneupdate.html]
aws_s3_object.redirects["/concepts/changelogs/attributes/use-sql-plus-oracle-proxy-server.html"]: Refreshing state... [id=/concepts/changelogs/attributes/use-sql-plus-oracle-proxy-server.html]
aws_s3_object.redirects["/install/tutorials/teradata.html"]: Refreshing state... [id=/install/tutorials/teradata.html]
aws_s3_object.redirects["/workflows/liquibase-pro/extensions-list.html"]: Refreshing state... [id=/workflows/liquibase-pro/extensions-list.html]
aws_s3_object.redirects["/concepts/advanced/contexts.html"]: Refreshing state... [id=/concepts/advanced/contexts.html]
aws_s3_object.redirects["/tools-integrations/native-executors/home.html"]: Refreshing state... [id=/tools-integrations/native-executors/home.html]
aws_s3_object.redirects["/secrets-management/home.html"]: Refreshing state... [id=/secrets-management/home.html]
aws_s3_object.redirects["/commands/community/quality-checks/checks-customize.html"]: Refreshing state... [id=/commands/community/quality-checks/checks-customize.html]
aws_s3_object.redirects["/commands/rollbackonechangesetsql.html"]: Refreshing state... [id=/commands/rollbackonechangesetsql.html]
aws_s3_object.redirects["/concepts/basic/changeset.html"]: Refreshing state... [id=/concepts/basic/changeset.html]
aws_s3_object.redirects["/tools-integrations/feature-flags/readmes/configcat-feature-flags-extension.html"]: Refreshing state... [id=/tools-integrations/feature-flags/readmes/configcat-feature-flags-extension.html]
aws_s3_object.redirects["/commands/pro/rollbackoneupdate.html"]: Refreshing state... [id=/commands/pro/rollbackoneupdate.html]
aws_s3_object.redirects["/change-types/pro/create-function.html"]: Refreshing state... [id=/change-types/pro/create-function.html]
aws_s3_object.redirects["/change-types/pro/disable-trigger.html"]: Refreshing state... [id=/change-types/pro/disable-trigger.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-rollback-one-changeset.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-rollback-one-changeset.html]
aws_s3_object.redirects["/drift-reports"]: Refreshing state... [id=/drift-reports]
aws_s3_object.redirects["/workflows/liquibase-pro/mysqlgrants.html"]: Refreshing state... [id=/workflows/liquibase-pro/mysqlgrants.html]
aws_s3_object.redirects["/commands/quality-checks/checks/changelog-checks/max-affected-rows-allowed-insert.html"]: Refreshing state... [id=/commands/quality-checks/checks/changelog-checks/max-affected-rows-allowed-insert.html]
aws_s3_object.redirects["/start/release-notes/liquibase-4.10.0.html"]: Refreshing state... [id=/start/release-notes/liquibase-4.10.0.html]
aws_s3_object.redirects["/feature-flags/readmes/Flipt Feature Flags Extension.html"]: Refreshing state... [id=/feature-flags/readmes/Flipt Feature Flags Extension.html]
aws_s3_object.redirects["/feature-flags/readmes/supported editions.html"]: Refreshing state... [id=/feature-flags/readmes/supported editions.html]
aws_s3_object.redirects["/commands/flow/advanced-flow-file.html"]: Refreshing state... [id=/commands/flow/advanced-flow-file.html]
aws_s3_object.redirects["/commands/quality-checks/checks/changelog-database-checks/table-comment-pattern-check.html"]: Refreshing state... [id=/commands/quality-checks/checks/changelog-database-checks/table-comment-pattern-check.html]
aws_s3_object.redirects["/commands/quality-checks/command-arguments/home.html"]: Refreshing state... [id=/commands/quality-checks/command-arguments/home.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/hsqldb.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/hsqldb.html]
aws_s3_object.redirects["/commands/updatecountsql.html"]: Refreshing state... [id=/commands/updatecountsql.html]
aws_s3_object.redirects["/change-types/pro/drop-package.html"]: Refreshing state... [id=/change-types/pro/drop-package.html]
aws_s3_object.redirects["/commands/change-tracking/tag-exists.html"]: Refreshing state... [id=/commands/change-tracking/tag-exists.html]
aws_s3_object.redirects["/commands/community/update.html"]: Refreshing state... [id=/commands/community/update.html]
aws_s3_object.redirects["/concepts/changelog.html"]: Refreshing state... [id=/concepts/changelog.html]
aws_s3_object.redirects["/change-types/community/rename-table.html"]: Refreshing state... [id=/change-types/community/rename-table.html]
aws_s3_object.redirects["/tools-integrations/observability/meta-data-structured-logs.html"]: Refreshing state... [id=/tools-integrations/observability/meta-data-structured-logs.html]
aws_s3_object.redirects["/commands/community/changelogsyncsql.html"]: Refreshing state... [id=/commands/community/changelogsyncsql.html]
aws_s3_object.redirects["/start/install/tutorials/enterprisedb.html"]: Refreshing state... [id=/start/install/tutorials/enterprisedb.html]
aws_s3_object.redirects["/start/tutorials/firebird.html"]: Refreshing state... [id=/start/tutorials/firebird.html]
aws_s3_object.redirects["/concepts/changelogs/changelog-formats.html"]: Refreshing state... [id=/concepts/changelogs/changelog-formats.html]
aws_s3_object.redirects["/tools-integrations/ant/commands/dbdoc.html"]: Refreshing state... [id=/tools-integrations/ant/commands/dbdoc.html]
aws_s3_object.redirects["/commands/quality-checks/object-name-must-not-match.html"]: Refreshing state... [id=/commands/quality-checks/object-name-must-not-match.html]
aws_s3_object.redirects["/commands/maintenance/clear-checksums.html"]: Refreshing state... [id=/commands/maintenance/clear-checksums.html]
aws_s3_object.redirects["/tools-integrations/maven/commands/maven-rollback-sql.html"]: Refreshing state... [id=/tools-integrations/maven/commands/maven-rollback-sql.html]
aws_s3_object.redirects["/workflows/database-setup-tutorials/cloud-spanner.html"]: Refreshing state... [id=/workflows/database-setup-tutorials/cloud-spanner.html]
aws_s3_object.redirects["/tools-integrations/ant/getting-started-liquibase-ant.html"]: Refreshing state... [id=/tools-integrations/ant/getting-started-liquibase-ant.html]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_s3_object.redirects["/commands/community/rollbackbytag.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/community/rollbackbytag.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/rollback/rollback-by-tag.html" -> "/commands/rollback/rollback.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/commands/rollback/rollback-by-tag.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/rollback/rollback-by-tag.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/commands/rollback/rollback.html"
    }

  # aws_s3_object.redirects["/commands/rollback/rollback-from-tag.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/rollback/rollback-from-tag.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/commands/rollback/rollback.html"
    }

  # aws_s3_object.redirects["/commands/rollback/rollback-to-tag.html"] will be created
  + resource "aws_s3_object" "redirects" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "prod-docsliquibasecom-origin"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "/commands/rollback/rollback-to-tag.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
      + website_redirect       = "/commands/rollback/rollback.html"
    }

  # aws_s3_object.redirects["/commands/rollbackbytag.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/commands/rollbackbytag.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/rollback/rollback-by-tag.html" -> "/commands/rollback/rollback.html"
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/dropall"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/dropall"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/utility/drop-all.html" -> "/commands/utility/drop-all.html "
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.redirects["/dropall.html"] will be updated in-place
  ~ resource "aws_s3_object" "redirects" {
        id                     = "/dropall.html"
        tags                   = {}
      ~ version_id             = "null" -> (known after apply)
      ~ website_redirect       = "/commands/utility/drop-all.html" -> "/commands/utility/drop-all.html "
        # (11 unchanged attributes hidden)
    }

Plan: 3 to add, 4 to change, 0 to destroy.

[01J58P153N01WEF2EG4BP2SD5T] Changes are GO
[01J58P153N01WEF2EG4BP2SD5T] Uploading the list of managed resources...
[01J58P153N01WEF2EG4BP2SD5T] Generating Infracost JSON report from plan

[01J58P153N01WEF2EG4BP2SD5T] Infracost report generated successfully
[01J58P153N01WEF2EG4BP2SD5T] Mapping Infracost data to resources
[01J58P153N01WEF2EG4BP2SD5T] Costs mapped successfully
[01J58P153N01WEF2EG4BP2SD5T] Please be aware that the run changes calculation includes output changes.
[01J58P153N01WEF2EG4BP2SD5T] Resource list upload is GO
[01J58P153N01WEF2EG4BP2SD5T] Generating JSON representation of the plan...
[01J58P153N01WEF2EG4BP2SD5T] JSON representation is GO
[01J58P153N01WEF2EG4BP2SD5T] Generating Infracost JSON report from plan

[01J58P153N01WEF2EG4BP2SD5T] Infracost report generated successfully
[01J58P153N01WEF2EG4BP2SD5T] Loading custom plan policy inputs...
[01J58P153N01WEF2EG4BP2SD5T] 0 custom plan policy inputs found
[01J58P153N01WEF2EG4BP2SD5T] No plan policies to evaluate
```

</details>